import math
import asyncio
import pandas as pd

from elasticsearch import AsyncElasticsearch

from app.core.settings import settings


class PatentSearchEvaluator:
    def __init__(self):
        self.es = AsyncElasticsearch(
            settings.elasticsearch_url
        )

        self.index_name = "patents"

        self.search_modes = [
            ("OR", "OR"),
            ("MSM_10", 0.1),
            ("MSM_20", 0.2),
            ("MSM_30", 0.3),
            ("MSM_40", 0.4),
            ("MSM_50", 0.5),
            ("MSM_60", 0.6),
            ("MSM_70", 0.7),
            ("MSM_80", 0.8),
            ("MSM_90", 0.9),
            ("AND", "AND"),
        ]


    async def evaluate(self, dataset: list[dict]):
        metrics_results = []
        detailed_results = []
        match_rate_results = []

        for mode_name, msm in self.search_modes:
            print(f"\n=== {mode_name} ===")
            ranks = []

            for sample in dataset:
                source_patent = sample["source_patent"]
                target_patent = sample["target_patent"]
                source_keywords = sample["source_keywords"]
                target_keywords = sample["target_keywords"]

                rank, required_matches = await self.find_target_rank(
                    keywords=source_keywords,
                    target_patent=target_patent,
                    msm=msm
                )

                ranks.append(rank)

                matched_keywords = (
                    self.calculate_keyword_overlap(
                        source_keywords,
                        target_keywords
                    )
                )

                match_rate = (
                    matched_keywords /
                    len(source_keywords)
                )

                detailed_results.append({
                    "mode": mode_name,
                    "source_patent": source_patent,
                    "target_patent": target_patent,
                    "rank": rank,
                    "required_matches": required_matches,
                    "matched_keywords": matched_keywords,
                    "source_keyword_count": len(source_keywords),
                    "match_rate": round(match_rate, 4)
                })

                match_rate_results.append({
                    "source_patent": source_patent,
                    "target_patent": target_patent,
                    "matched_keywords": matched_keywords,
                    "source_keyword_count": len(source_keywords),
                    "match_rate": round(match_rate, 4)
                })

                print(
                    f"{source_patent} -> "
                    f"{target_patent} | "
                    f"rank={rank} | "
                    f"match_rate={match_rate:.2f} | "
                    f"required={required_matches}/"
                    f"{len(source_keywords)}"
                )

            metrics = self.calculate_metrics(ranks)
            metrics["mode"] = mode_name
            metrics_results.append(metrics)

        metrics_df = pd.DataFrame(metrics_results)
        detailed_df = pd.DataFrame(detailed_results)
        match_rate_df = pd.DataFrame(match_rate_results)

        print("\n=== METRICS ===")
        print(metrics_df)

        metrics_df.to_csv(
            "patent_search_metrics.csv",
            index=False
        )

        detailed_df.to_csv(
            "patent_search_detailed.csv",
            index=False
        )

        match_rate_df.to_csv(
            "patent_match_rates.csv",
            index=False
        )

        return {
            "metrics": metrics_df,
            "details": detailed_df,
            "match_rates": match_rate_df
        }


    async def find_target_rank(
        self,
        keywords: list[str],
        target_patent: str,
        msm
    ):

        should_clauses = []

        for keyword in keywords:
            should_clauses.append({
                "multi_match": {
                    "query": keyword,
                    "fields": [
                        "title",
                        "abstract",
                        "description",
                        "claims"
                    ]
                }
            })

        keyword_count = len(keywords)

        if msm == "OR":
            minimum_should_match = 1

        elif msm == "AND":
            minimum_should_match = keyword_count

        else:
            minimum_should_match = math.ceil(
                keyword_count * msm
            )

        query = {
            "size": 1000,
            "query": {
                "bool": {
                    "should": should_clauses,
                    "minimum_should_match":
                        minimum_should_match
                }
            }
        }

        response = await self.es.search(
            index=self.index_name,
            body=query
        )

        hits = response["hits"]["hits"]

        for idx, hit in enumerate(hits):
            publication_number = (
                hit["_source"]
                .get("publication_number")
            )

            if publication_number == target_patent:
                return idx + 1, minimum_should_match

        return None, minimum_should_match


    def calculate_keyword_overlap(
        self,
        source_keywords,
        target_keywords
    ):

        source_set = set(
            kw.lower().strip()
            for kw in source_keywords
        )

        target_set = set(
            kw.lower().strip()
            for kw in target_keywords
        )

        intersection = (
            source_set.intersection(target_set)
        )

        return len(intersection)


    def calculate_metrics(self, ranks):
        total = len(ranks)

        hr10 = sum(
            1 for r in ranks
            if r is not None and r <= 10
        ) / total

        hr25 = sum(
            1 for r in ranks
            if r is not None and r <= 25
        ) / total

        hr50 = sum(
            1 for r in ranks
            if r is not None and r <= 50
        ) / total

        hr_all = sum(
            1 for r in ranks
            if r is not None
        ) / total

        reciprocal_sum = 0

        for r in ranks:
            if r:
                reciprocal_sum += 1 / r

        mrr = reciprocal_sum / total

        avg_pos = (
            1 / mrr
            if mrr > 0 else None
        )

        return {
            "HR@10": round(hr10, 4),
            "HR@25": round(hr25, 4),
            "HR@50": round(hr50, 4),
            "HR@All": round(hr_all, 4),
            "MRR": round(mrr, 4),
            "AvgPos": (
                round(avg_pos, 4)
                if avg_pos else None
            )
        }


async def main():
    dataset = [
        {
            "source_patent": "RU2532846C2",
            "target_patent": "RU2318299C2",
            "source_keywords": [
                "система охлаждения серверов",
                "охлаждающий модуль",
                "безвентиляторный блок",
                "стоечное исполнение",
                "воздух",
                "корпус",
                "температура",
                "перемешивающий вентилятор"
            ],
            "target_keywords": [
                "система",
                "воздушно-водяной теплообменник",
                "вытяжной воздух",
                "нижняя дверца",
                "вентилятор"
            ]
        },

        {
            "source_patent": "RU2532531C2",
            "target_patent": "RU2331989C2",
            "source_keywords": [
                "способ",
                "передача",
                "беспроводной терминал",
                "опорный сигнал",
                "ненулевая мощность",
                "элемент",
                "антенна",
                "коммуникация",
                "канал"
            ],
            "target_keywords": [
                "способ",
                "определение уровня благоприятной возможности",
                "каждый терминал доступа",
                "подмножество",
                "канал обратной линии",
                "приоритет"
            ]
        },

        {
            "source_patent": "RU2533860C1", 
            "target_patent": "RU2254539C1", 
            "source_keywords": [
                "телескопический приклад",
                "адаптер",
                "направляющая втулка",
                "спиральный шлиц",
                "ответный паз",
                "корпус оружия",
                "пружина"
            ],
            "target_keywords": [
                "стрелковое оружие",
                "кулачковый курок",
                "пружина",
                "запирающий рычаг",
                "ступенчатый выступ",
                "ствольная коробка",
                "спусковой крючок",
                "осевая втулка",
                "гребень",
                "поршень",
                "переключатель",
                "патронная база",
                "перезаряжа"
            ]
        },

        {
            "source_patent": "RU2532539C2",
            "target_patent": "RU2198230C2",
            "source_keywords": [
                "способ изготовления текстурированной электротехнической стали",
                "отжиг",
                "холодная прокатка",
                "стальный лист",
                "температура",
                "ингибитор"
            ],
            "target_keywords": [
                "ингибирование",
                "текстурированная сталь",
                "холодная прокатка",
                "нитрид алюминия",
                "вторичная фаза",
                "азот"
            ]
        },

        {
            "source_patent": "RU147861U1",
            "target_patent": "RU194260U1",
            "source_keywords": [
                "вторичный паросиловой контур",
                "ДВС",
                "выпускной тракт",
                "спиральный трубопровод",
                "теплообменник",
                "парообразующая жидкость",
                "сопло",
                "система охлаждения",
                "двигатель",
                "КПД"
            ],
            "target_keywords": [
                "решето",
                "зерноуборочный комбайн",
                "рама",
                "поворотная ось",
                "паз-паз",
                "сварочный шов",
                "выточка",
                "заклёпка",
                "фиксация",
                "полость"
            ]
        },

        {
            "source_patent": "RU2532727C2",
            "target_patent": "RU2201189C2",
            "source_keywords": [
                "подгузник одноразового использования",
                "наружный гидрофильный лист",
                "поясной клапан",
                "поглощающий элемент",
                "экзема",
                "контактный дерматит"
            ],
            "target_keywords": [
                "абсорбирующее изделие",
                "продольная ось",
                "барьер для влаги",
                "первый поясной участок",
                "проницаемая кромка",
                "лист",
                "регулирующий слой",
                "жидкость",
                "вместимость",
                "вода",
                "контроль"
            ]
        },

        {
            "source_patent": "RU2532280C2",
            "target_patent": "RU2127611C1",
            "source_keywords": [
                "шприц",
                "шток поршня",
                "наклонная поверхность",
                "проксимальный конец",
                "цилиндр",
                "запирающий элемент",
                "запорная часть",
                "выступ",
                "дистальное направление"
            ],
            "target_keywords": [
                "одноразовый шприц",
                "стопорный элемент",
                "храповой зуб",
                "втулка",
                "шток",
                "пружинный зажим",
                "наконечник",
                "жидкость",
                "цилиндр"
            ]
        },

        {
            "source_patent": "RU2532612C2",
            "target_patent": "RU85383U1",
            "source_keywords": [
                "режущая пластина",
                "пластинчатый элемент",
                "многоугольная внешняя форма",
                "стружколомный участок",
                "дугообразная режущая кромка",
                "нижняя поверхность",
                "резание",
                "металл",
                "толщина"
            ],
            "target_keywords": [
                "многогранная пластина",
                "стружкозавивающая поверхность",
                "дуга",
                "переменный профиль",
                "стружка",
                "передний угол",
                "кривизна"
            ]
        },

        {
            "source_patent": "RU2532248C2",
            "target_patent": "RU2233032C2",
            "source_keywords": [
                "пользовательское оборудование",
                "передача",
                "восходящая линия",
                "сигнал",
                "помеха",
                "SDU",
                "коэффициент ошибочных кадров"
            ],
            "target_keywords": [
                "символьные шаблоны",
                "система мобильной связи",
                "инвертирование фазы",
                "второй ортогональный код",
                "постоянная усиления",
                "расширение",
                "шестой расширенный сигнал"
            ]
        },

        {
            "source_patent": "RU2532651C2",
            "target_patent": "RU2110792C1",
            "source_keywords": [
                "ультразвуковой расходомер",
                "пьезоэлемент",
                "центральная ось",
                "второй конец",
                "корпус",
                "распорка",
                "осевая длина",
                "патрубок"
            ],
            "target_keywords": [
                "пьезоэлектрический преобразователь",
                "акустическая эмиссия",
                "корпус",
                "гребенка",
                "волновод",
                "наружный контур",
                "мембрана",
                "электромагнитный сигнал",
                "дефект",
                "канал"
            ]
        },

        {
            "source_patent": "RU2532308C2",
            "target_patent": "RU8938U1",
            "source_keywords": [
                "водоотталкивающая композиция",
                "полиалкилсилоксановая смола",
                "силиконовая жидкость",
                "гидрофобная пленка",
                "крем",
                "лосьон",
                "эмульсия",
                "раствор",
                "твердое вещество"
            ],
            "target_keywords": [
                "щетка стеклоочистителя",
                "корпус",
                "экструдированный силикон",
                "микровыпуклость",
                "поверхность",
                "надрыв"
            ]
        },
        
        {
            "source_patent": "RU2532513C1",
            "target_patent": "RU2993U1",
            "source_keywords": [
                "звукопоглощающий элемент",
                "многослойная конструкция",
                "перфорированная поверхность",
                "вспененный материал",
                "минеральная вата",
                "профилированный слой",
                "стержень",
                "стекловойлок",
                "винт",
                "эффективность",
                "шумоглушение"
            ],
            "target_keywords": [
                "шумоглушение",
                "промышленная акустика",
                "звукопоглощающий слой",
                "перфорированная стенка",
                "воздушный промежуток"
            ]
        },

        {
            "source_patent": "RU2532706C2",
            "target_patent": "RU2338336C2",
            "source_keywords": [
                "мобильная станция",
                "функциональный модуль первого уровня",
                "модуль определения",
                "широковещательная информация",
                "пороговое значение",
                "блокировка"
            ],
            "target_keywords": [
                "способ",
                "бездействующее устройство связи",
                "адресат",
                "передача информации",
                "короткий пакет данных",
                "инфраструктура",
                "беспроводная связь",
                "ответ",
                "поисковый вызов",
                "доступ",
                "сеть"
            ]
        },

        {
            "source_patent": "RU2533963C1",
            "target_patent": "RU2141800C1",
            "source_keywords": [
                "хирургическая операция",
                "коррекция высокой спинки",
                "спинка носа",
                "эндоназальное отделение",
                "мягкая ткань",
                "глабелла",
                "рассасывающаяся нить",
                "надкостничный шов"
            ],
            "target_keywords": [
                "способ Н.С.Руденко",
                "хирургическое лечение",
                "высокая спинка",
                "переносье",
                "парамедиальная остеотомия",
                "хрящевая горбина",
                "наружный угол глаза",
                "насечка"
            ]
        },

        {
            "source_patent": "RU2532385C2",
            "target_patent": "RU2322955C2",
            "source_keywords": [
                "матрикс",
                "костной имплантат",
                "биоразлагаемый полимер",
                "полиакрилат",
                "гидролизованный желатин",
                "полисахариды",
                "гомогенная дисперсия",
                "костная ткань",
                "спирт",
                "растворитель",
                "пролиферация",
                "клетка"
            ],
            "target_keywords": [
                "полимериммобилизованный препарат",
                "деминерализованная матрица",
                "микрохлорид",
                "хондроитинсульфат",
                "бактерицидное действие",
                "кетгутовый шов",
                "регенерация",
                "хрящевая ткань"
            ]
        },

        {
            "source_patent": "RU2532616C2",
            "target_patent": "RU2144U1",
            "source_keywords": [
                "модель маски",
                "кольцевая турбина",
                "камера сгорания",
                "корпус",
                "рабочая машина",
                "интерация",
                "положение",
                "ось",
                "отверстие"
            ],
            "target_keywords": [
                "измерительная головка",
                "источник излучения",
                "фотопривод",
                "точка",
                "измерение",
                "профиль",
                "поверхность",
                "позиционное перемещение",
                "электронный блок",
                "блок управления"
            ]
        },

        {
            "source_patent": "RU2532810C2",
            "target_patent": "RU2134129C1",
            "source_keywords": [
                "схематическое изображение",
                "упаковочный материал",
                "поперечное направление",
                "катушка",
                "растворитель",
                "широтно-импульсная модуляция"
            ],
            "target_keywords": [
                "устройство для воздействия магнитным полем",
                "биологический объект",
                "источник тока",
                "фазорасщепитель",
                "усилитель мощности",
                "соленоид",
                "частота",
                "молекулярное поле",
                "перекисное соединение",
                "вода",
                "вирус",
                "передача"
            ]
        },

        {
            "source_patent": "RU2532270C2",
            "target_patent": "RU2023379C1",
            "source_keywords": [
                "обвязочное устройство",
                "направляющая рама",
                "фиксация",
                "тюковый материал",
                "высота",
                "транспортировочное основание"
            ],
            "target_keywords": [
                "пресс",
                "устройство ввода",
                "цилиндрический тюк",
                "перегородка",
                "подводящий канал",
                "подающий элемент",
                "ограничитель",
                "впускное отверстие",
                "обвязочное средство",
                "гибкая лопасть",
                "привод"
            ]
        },

        {
            "source_patent": "RU147542U1",
            "target_patent": "RU173291U1",
            "source_keywords": [
                "каркас",
                "рукавный фильтр",
                "вертикальная форма",
                "крепежная деталь",
                "продольное ребро",
                "поперечный пруток",
                "металлическое кольцо"
            ],
            "target_keywords": [
                "фильтровальный элемент",
                "рукавный фильтр",
                "горизонтальная форма",
                "торцевая пластина",
                "металлический пруток",
                "вогнутость"
            ]
        },

        {
            "source_patent": "RU2532804C2",
            "target_patent": "RU2118499C1",
            "source_keywords": [
                "изолирующая одежда",
                "текстильная поверхность",
                "наружная ткань",
                "микроволокно",
                "гидрофобизирующая обработка",
                "влага"
            ],
            "target_keywords": [
                "способ образования наружной поверхности одежды",
                "непромокаемая ткань",
                "прорезиненная одежда",
                "потоотделение",
                "газообмен",
                "марля"
            ]
        },

        {
            "source_patent": "RU2532468C1",
            "target_patent": "RU96467U1",
            "source_keywords": [
                "устройство для сушки зерна",
                "кожух прямоугольного сечения",
                "поверхность",
                "теплоизолирующий материал",
                "загрузочный бункер",
                "выгрузное окно",
                "нагревательный элемент",
                "шибер"
            ],
            "target_keywords": [
                "устройство для сушки зерна",
                "цилиндрический кожух",
                "теплоизолирующий материал",
                "загрузочный бункер",
                "выгрузное окно",
                "нагревательный элемент",
                "пластина",
                "пар",
                "вентилятор",
                "воздуховод"
            ]
        },

        {
            "source_patent": "RU2532768C1",
            "target_patent": "RU2241769C1",
            "source_keywords": [
                "способ производства толстолистового штрипса",
                "слябовая заготовка",
                "температура",
                "охлаждение",
                "готовый лист"
            ],
            "target_keywords": [
                "свариваемость",
                "штрипс",
                "низколегированная сталь",
                "методическая печь",
                "цинк"
            ]
        },

        {
            "source_patent": "RU2533712C1",
            "target_patent": "RU25010U1",
            "source_keywords": [
                "машина для белья",
                "упомянутая насадка",
                "первый участок",
                "испаритель",
                "воздушный канал",
                "конденсационная вода",
                "воздух",
                "поток"
            ],
            "target_keywords": [
                "машина для сушки белья",
                "перфорированный барабан",
                "загрузочный люк",
                "вентилятор",
                "крышка"
            ]
        },

        {
            "source_patent": "RU2533335C2",
            "target_patent": "RU96115551A",
            "source_keywords": [
                "устройство",
                "источник",
                "ближний ИК-свет",
                "ускорение",
                "жидкость",
                "уровень"
            ],
            "target_keywords": [
                "жидкость",
                "растровый экран",
                "светопропускающий материал",
                "секция",
                "отражающая поверхность",
                "цвет",
                "материал сосуда"
            ]
        },

        {
            "source_patent": "RU2533646C2",
            "target_patent": "RU2246749C2",
            "source_keywords": [
                "устройство обработки информации",
                "сенсорный экран",
                "направление движения",
                "оператор",
                "дисплей",
                "команда"
            ],
            "target_keywords": [
                "устройство для ввода информации",
                "излучатель",
                "приемник излучения",
                "оптическая ось",
                "палец"
            ]
        },

        {
            "source_patent": "RU2533441C2",
            "target_patent": "RU2225034C2",
            "source_keywords": [
                "поиск изображения",
                "история поиска",
                "обратная связь",
                "идентифицированное изображение",
                "выбранная целевая область"
            ],
            "target_keywords": [
                "способ",
                "интерпретация сигналов",
                "многоэтапное преобразование",
                "точка",
                "пик"
            ]
        },

        {
            "source_patent": "RU2533451C2",
            "target_patent": "RU2004131029A",
            "source_keywords": [
                "компьютерная система",
                "выдача данных презентации",
                "приложение просмотра",
                "считывание данных",
                "локальная презентация"
            ],
            "target_keywords": [
                "машиночитаемый носитель",
                "упомянутое устройство",
                "пользовательский интерфейс",
                "указание",
                "альтернативное устройство отображения"
            ]
        },

        {
            "source_patent": "RU2533058C2",
            "target_patent": "RU104732U1",
            "source_keywords": [
                "Универсальное устройство",
                "передача излучения",
                "распределенный источник",
                "ультрафиолетовое излучение",
                "сферическая антенна",
                "кольцевой зазор",
                "изменяемая конфигурация",
                "концентрация",
                "объем",
                "фокальная зона"
            ],
            "target_keywords": [
                "электроакустическое устройство",
                "многоэлементная антенна",
                "стержневой преобразователь",
                "полусферическая апертура",
                "фазовый центр",
                "гидроизоляция",
                "линия коммуникаций",
                "ввод",
                "выведение",
                "ультразвуковой сигнал",
                "канал",
                "волна"
            ]
        },

        {
            "source_patent": "RU2533706C2",
            "target_patent": "RU2243934C2",
            "source_keywords": [
                "капсула",
                "капсулодержатель",
                "игла",
                "разбрызгивающее средство",
                "ввод",
                "жидкость",
                "напиток",
                "перфорация",
                "корпус",
                "верхняя стенка",
                "камера",
                "фильтр-кофе"
            ],
            "target_keywords": [
                "капсула",
                "порционная упаковка",
                "кофейный порошок",
                "заварочная вода",
                "распределитель",
                "крышка",
                "пробойник",
                "жидкость"
            ]
        },

        {
            "source_patent": "RU2533500C2",
            "target_patent": "RU2282392C1",
            "source_keywords": [
                "система",
                "интерактивный анализ",
                "медицинские изображения",
                "сопроводительные вероятности",
                "алгоритмы классификаторов"
            ],
            "target_keywords": [
                "стоматология",
                "приемник",
                "тепловизионное изображение",
                "нижняя челюсть",
                "рентгеновская диагностика",
                "лечение",
                "пародонтоз",
                "терапия",
                "протезирование",
                "зуб"
            ]
        },

        {
            "source_patent": "RU2533829C2",
            "target_patent": "RU2239919C2",
            "source_keywords": [
                "свинцово-кислотная батарея",
                "заливной тип",
                "контейнер",
                "нетканое полотно",
                "отрицательная пластина",
                "бисфенол",
                "целлюлоза",
                "полиолефин"
            ],
            "target_keywords": [
                "патент",
                "свинцово-кислотная батарея",
                "клапанное управление",
                "щелочная масса",
                "вход газа",
                "банка нейтрализации",
                "водород"
            ]
        },

        {
            "source_patent": "RU148023U1",
            "target_patent": "RU167313U1",
            "source_keywords": [
                "высокочастотный симметричный кабель",
                "сердечник",
                "однопроволочная жила",
                "алюминиевая фольга",
                "ламинированная пленка",
                "кремнийорганическая резина",
                "экранированная пара",
                "полимерный материал",
                "изоляция",
                "фольгированный экран",
                "поливинилхлоридная резинка",
                "оболочка"
            ],
            "target_keywords": [
                "кабель связи",
                "симметричный кабель",
                "огнестойкая модель",
                "сердечник",
                "изолированная жила",
                "кремнийорганическая резина",
                "полимерная лента",
                "термопластичный полимер",
                "алюмополимерная нить",
                "разность времени задержки",
                "возвратные потери"
            ]
        },

        {
            "source_patent": "RU2015131957A",
            "target_patent": "RU2646713C1",
            "source_keywords": [
                "пакет тарельчатых пружин",
                "внешний корпус",
                "внутренний диск",
                "коническая пружина",
                "демпфирующий элемент",
                "цилиндрическая поверхность",
                "крышка",
                "центрирующий цилиндрический буртик",
                "проточка",
                "радиальная жесткость"
            ],
            "target_keywords": [
                "пакет пружин",
                "тарельчатая пружина",
                "цилиндрический корпус",
                "проточка",
                "конический диск",
                "вибродемпфирующий материал",
                "поршень"
            ]
        },

        {
            "source_patent": "RU2533445C2",
            "target_patent": "RU2441268C2",
            "source_keywords": [
                "мобильный терминал",
                "мобильная система",
                "запоминающее устройство",
                "модуль камеры",
                "фотография",
                "объект",
                "пороговое значение"
            ],
            "target_keywords": [
                "устройство отображения изображения",
                "блок детектирования",
                "поверхность операций",
                "указание",
                "обработка",
                "прокрутка",
                "перемещение",
                "операция сведения пальцев"
            ]
        },

        {
            "source_patent": "RU2533812C1",
            "target_patent": "RU2008124859A",
            "source_keywords": [
                "фотонный кристалл",
                "структура",
                "инверсный опал",
                "сшитый материал",
                "матрица",
                "диоксид кремния",
                "полимеризация",
                "полоса излучения"
            ],
            "target_keywords": [
                "фотонно-кристаллические пленки",
                "метод гидролиза тетраэтоксисилана",
                "пленка монодисперсных сферических частиц кремнезема",
                "диметилсульфоксид",
                "вторичная суспензия",
                "спирт"
            ]
        },

        {
            "source_patent": "RU2533193C2",
            "target_patent": "RU2225076C2",
            "source_keywords": [
                "способ",
                "Электронная программа Передач",
                "DTVT",
                "информация переключения",
                "базовая услуга",
                "база"
            ],
            "target_keywords": [
                "система цифрового телевидения",
                "декодер",
                "передача",
                "аудиовизуальная информация",
                "канал",
                "информационная задержка"
            ]
        },

        {
            "source_patent": "RU2522735C9",
            "target_patent": "RU2034284C1",
            "source_keywords": [
                "люминесцентный сенсор",
                "пара гидразина",
                "диэлектрическая подложка",
                "полупроводниковая точка",
                "электрод",
                "фотопроводимость"
            ],
            "target_keywords": [
                "датчик концентрации паров гидразина",
                "диэлектрическая подложка",
                "ГПС",
                "гетерополисоединение",
                "катионная часть",
                "никель",
                "тантал",
                "селективность"
            ]
        },

        {
            "source_patent": "RU2533539C1",
            "target_patent": "RU44829U1",
            "source_keywords": [
                "пьезоэлемент-резонатор",
                "разность потенциалов",
                "пьезокерамический элемент",
                "электрическая энергия",
                "шарик",
                "тарировка"
            ],
            "target_keywords": [
                "датчик ударного ускорения",
                "биморфный пьезоэлемент",
                "пластина",
                "концевой участок",
                "электрод",
                "поляризация",
                "заряд",
                "наружная поверхность",
                "зазор"
            ]
        },

        {
            "source_patent": "RU2533163C1",
            "target_patent": "RU2226026C2",
            "source_keywords": [
                "вращающаяся электрическая машина",
                "схема",
                "торцевой участок",
                "катушка",
                "паз"
            ],
            "target_keywords": [
                "обмотка статора",
                "высоковольтная электрическая машина",
                "переменный ток",
                "многослойное соединение",
                "корпусная часть",
                "полуфаза",
                "нечетный слой",
                "встык"
            ]
        },

        {
            "source_patent": "RU2533695C2",
            "target_patent": "RU2198471C2",
            "source_keywords": [
                "способ передачи данных",
                "устройство приема",
                "запрос",
                "значение подсчета",
                "энергозависимое запоминающее устройство",
                "ключ дешифрования"
            ],
            "target_keywords": [
                "патент",
                "центральная станция обслуживания",
                "цифровая коммуникационная сеть",
                "абонентский пост",
                "версия",
                "дискета"
            ]
        },

        {
            "source_patent": "RU2533694C2",
            "target_patent": "RU2025771C1",
            "source_keywords": [
                "электронное устройство",
                "пластина размещения",
                "первый внешний элемент",
                "подложка",
                "участок зацепления",
                "вторая поверхность",
                "выступ",
                "опора"
            ],
            "target_keywords": [
                "плоская клавиатура",
                "пьезоэлектрический элемент",
                "несущая пленка",
                "контактная площадка",
                "печатный проводник",
                "защитная пластина",
                "выемка",
                "заземляющий контакт",
                "электроника"
            ]
        },

        {
            "source_patent": "RU2533453C2",
            "target_patent": "RU2189345C2",
            "source_keywords": [
                "автоматическое устройство для транзакций",
                "верхний блок",
                "секция для приема/выдачи",
                "кассета",
                "носитель"
            ],
            "target_keywords": [
                "электронная кассовая машина",
                "банковский автомат",
                "толщина",
                "банкнота",
                "канал перемещения",
                "лист",
                "излучатель",
                "приемник",
                "излучение",
                "участок",
                "точка",
                "порог"
            ]
        },

        {
            "source_patent": "RU2015128360A",
            "target_patent": "RU2651232C1",
            "source_keywords": [
                "модуль пожаротушения",
                "корпус",
                "вертикально установленный баллон",
                "огнетушащая жидкость",
                "сифонная трубка",
                "диффузор",
                "коническая поверхность",
                "лепесток",
                "фланец",
                "винтовые канавки"
            ],
            "target_keywords": [
                "модуль пожаротушения",
                "распылитель",
                "огнетушащая жидкость",
                "газовый объем",
                "баллон",
                "сигнализатор давления",
                "сифонная трубка",
                "диффузор",
                "коническая полость"
            ]
        },

        {
            "source_patent": "RU2533321C1",
            "target_patent": "RU2253096C1",
            "source_keywords": [
                "способ адаптивного прогнозирования",
                "остаточный ресурс",
                "технический объект",
                "мощность",
                "дефект"
            ],
            "target_keywords": [
                "метод оценки технического состояния",
                "пневмогидравлический агрегат",
                "фонтанная арматура скважины",
                "контроль",
                "регрессивный процесс",
                "ТСО",
                "прогнозная оценка",
                "безопасность",
                "оборудование"
            ]
        },

        {
            "source_patent": "RU2533446C2",
            "target_patent": "RU2454240C1",
            "source_keywords": [
                "лабораторные животные",
                "УФО",
                "контрольная группа",
                "трава звездчатки",
                "пероральное введение"
            ],
            "target_keywords": [
                "лабораторные животные",
                "ультрафиолетовое облучение",
                "пероральное введение",
                "листья крапивы",
                "береза",
                "подорожник",
                "осадок"
            ]
        },

        {
            "source_patent": "RU2533693C2",
            "target_patent": "RU2232476C2",
            "source_keywords": [
                "криптографическое вычисление",
                "точка Р",
                "хеширование",
                "подпись",
                "аутентификация"
            ],
            "target_keywords": [
                "эллиптическая кривая",
                "мобильная карточка",
                "микросхема",
                "резервное устройство",
                "память",
                "секретный код"
            ]
        },

        {
            "source_patent": "RU2533039C1",
            "target_patent": "RU2220629C1",
            "source_keywords": [
                "выделитель семян",
                "бахчевая культура",
                "загрузочный бункер",
                "нож",
                "опорная поверхность",
                "транспортер",
                "зубчатый барабан",
                "емкость"
            ],
            "target_keywords": [
                "выделитель семян",
                "плод",
                "бахчевая культура",
                "рама",
                "привод",
                "загрузочный бункер",
                "нож",
                "направляющее приспособление",
                "половинка",
                "вода",
                "поддон",
                "сушка"
            ]
        },

        {
            "source_patent": "RU2533077C2",
            "target_patent": "RU2231220C1",
            "source_keywords": [
                "радиосвязь",
                "псевдослучайная перестройка",
                "частота",
                "субсимвол",
                "кодовая последовательность"
            ],
            "target_keywords": [
                "дискретная информация",
                "радиолиния",
                "псевдослучайная последовательность",
                "двоичная частота",
                "блок",
                "передача",
                "частотный канал",
                "исправление ошибок",
                "демодуляция",
                "пакет",
                "помехозащищенность"
            ]
        },

        {
            "source_patent": "RU2533150C2",
            "target_patent": "RU2048496C1",
            "source_keywords": [
                "полимерная композиция на основе поливинилхлоридной смолы",
                "диоктилфталат",
                "эпоксидированное растительное масло",
                "стеарат цинка",
                "цинковый воск"
            ],
            "target_keywords": [
                "полимерная композиция",
                "суспензионный полимер",
                "ЭСМ"
            ]
        },

        {
            "source_patent": "RU2533048C1",
            "target_patent": "RU2008860C1",
            "source_keywords": [
                "когнитивная модуляция остроты зрения",
                "непрямая электростимуляция",
                "наружная треть правого глаза",
                "внутренняя треть левого",
                "электролабильность",
                "видеофильм"
            ],
            "target_keywords": [
                "электростимуляция",
                "первичная амблиопия",
                "монолатеральное косоглазие",
                "частота следования",
                "пачек"
            ]
        }
    ]

    evaluator = PatentSearchEvaluator()
    await evaluator.evaluate(dataset)
    await evaluator.es.close()


if __name__ == "__main__":
    asyncio.run(main())